In [46]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [47]:
%sql sqlite:///first-database-sql.db

# JOIN ISLEMLERI
Birlestirme islemleri yapiyoruz.

In [10]:
%%sql
SELECT name FROM sqlite_master WHERE TYPE = "table"

 * sqlite:///first-database-sql.db
Done.

[('Customers',),
 ('yeni_tablo',),
 ('Categories',),
 ('Employees',),
 ('OrderDetails',),
 ('Products',)]

In [12]:
%%sql
SELECT * FROM Categories LIMIT 3;

 * sqlite:///first-database-sql.db
Done.

[(1, 'Beverages', 'Soft drinks, coffees, teas, beers, and ales'),
 (2, 'Condiments', 'Sweet and savory sauces, relishes, spreads, and seasonings'),
 (3, 'Confections', 'Desserts, candies, and sweet breads')]

In [13]:
%%sql
SELECT * FROM Products LIMIT 3;

 * sqlite:///first-database-sql.db
Done.

[(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19),
 (3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10)]

## LEFT (OUTER) JOIN

Soldaki tablo ile kesisen, sagdaki tablo degerlerinin bir araya getirilmesi seklinde calisir.

Products tablosuna CategoryName degiskenini eklemek istiyorum;

In [15]:
%%sql
SELECT * FROM Products LEFT OUTER JOIN Categories ON Products.CategoryID = Categories.CategoryID LIMIT 5;

 * sqlite:///first-database-sql.db
Done.

[(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18, 1, 'Beverages', 'Soft drinks, coffees, teas, beers, and ales'),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19, 1, 'Beverages', 'Soft drinks, coffees, teas, beers, and ales'),
 (3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10, 2, 'Condiments', 'Sweet and savory sauces, relishes, spreads, and seasonings'),
 (4, "Chef Anton's Cajun Seasoning", 2, 2, '48 - 6 oz jars', 22, 2, 'Condiments', 'Sweet and savory sauces, relishes, spreads, and seasonings'),
 (5, "Chef Anton's Gumbo Mix", 2, 2, '36 boxes', 21, 2, 'Condiments', 'Sweet and savory sauces, relishes, spreads, and seasonings')]

(CategoryID ikisinde de oldugundan "Degiskende Coklama" oldu.)

##### Ä°ki tablodan istedigim degiskenleri birlestirmek istemedigimde;

In [25]:
%%sql
SELECT Products.ProductName, Categories.CategoryID, Categories.CategoryName FROM Products LEFT JOIN Categories LIMIT 5;

 * sqlite:///first-database-sql.db
Done.

[('Chais', 1, 'Beverages'),
 ('Chais', 2, 'Condiments'),
 ('Chais', 3, 'Confections'),
 ('Chais', 4, 'Dairy Products'),
 ('Chais', 5, 'Grains/Cereals')]

##### Iki tabloda da ortak olan CategoryID'ye gore birlestirmek istedigimde;

In [28]:
%%sql
SELECT Products.ProductName, Categories.CategoryID, Categories.CategoryName FROM Products LEFT JOIN Categories ON Products.CategoryID = Categories.CategoryID LIMIT 5;

 * sqlite:///first-database-sql.db
Done.

[('Chais', 1, 'Beverages'),
 ('Chang', 1, 'Beverages'),
 ('Aniseed Syrup', 2, 'Condiments'),
 ("Chef Anton's Cajun Seasoning", 2, 'Condiments'),
 ("Chef Anton's Gumbo Mix", 2, 'Condiments')]

#### Kisayol isimlendirmesi yaparak;

In [30]:
%%sql
SELECT PR.ProductName, CA.CategoryID, CA.CategoryName FROM Products AS PR LEFT JOIN Categories AS CA ON PR.CategoryID = CA.CategoryID LIMIT 5;

 * sqlite:///first-database-sql.db
Done.

[('Chais', 1, 'Beverages'),
 ('Chang', 1, 'Beverages'),
 ('Aniseed Syrup', 2, 'Condiments'),
 ("Chef Anton's Cajun Seasoning", 2, 'Condiments'),
 ("Chef Anton's Gumbo Mix", 2, 'Condiments')]

("AS" kullanmasan da bosluk bÄ±rakÄ±p yazdÄ±ÄÄ±nda sql dili bunu anlar.)

In [31]:
%%sql
SELECT PR.ProductName, CA.CategoryID, CA.CategoryName FROM Products PR LEFT JOIN Categories CA ON PR.CategoryID = CA.CategoryID LIMIT 5;

 * sqlite:///first-database-sql.db
Done.

[('Chais', 1, 'Beverages'),
 ('Chang', 1, 'Beverages'),
 ('Aniseed Syrup', 2, 'Condiments'),
 ("Chef Anton's Cajun Seasoning", 2, 'Condiments'),
 ("Chef Anton's Gumbo Mix", 2, 'Condiments')]

## INNER JOIN
Kesisen degerleri almak istedimizde kullanÄ±lÄ±r.

Siparis veren musterilerim siaprisID'lerine ve musterilen isimlerine ulasmak istiyorum;

In [32]:
%%sql
SELECT * FROM Customers LIMIT 3;

 * sqlite:///first-database-sql.db
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany'),
 (2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la ConstituciÃ³n 2222', 'MÃ©xico D.F.', '5021', 'Mexico'),
 (3, 'Antonio Moreno TaquerÃ­a', 'Antonio Moreno', 'Mataderos 2312', 'MÃ©xico D.F.', '5023', 'Mexico')]

In [34]:
%%sql
SELECT COUNT (*) FROM Customers;

 * sqlite:///first-database-sql.db
Done.

[(91,)]

In [36]:
%%sql
SELECT * FROM Orders LIMIT 3;

 * sqlite:///first-database-sql.db
Done.

[(10248, 90, 5, '4.07.1996', 3),
 (10249, 81, 6, '5.07.1996', 1),
 (10250, 34, 4, '8.07.1996', 2)]

In [37]:
%%sql
SELECT COUNT (*) FROM Orders;

 * sqlite:///first-database-sql.db
Done.

[(196,)]

(Musteriler unique degil; bir musteri birden fazla siparis vermis.)

In [43]:
%%sql
SELECT Orders.OrderID, Customers.CustomerName FROM Orders INNER JOIN Customers ON Orders.CustomerID = Customers.CustomerID LIMIT 10;

 * sqlite:///first-database-sql.db
Done.

[(10248, 'Wilman Kala'),
 (10249, 'TradiÃ§Ã£o Hipermercados'),
 (10250, 'Hanari Carnes'),
 (10251, 'Victuailles en stock'),
 (10252, 'SuprÃªmes dÃ©lices'),
 (10253, 'Hanari Carnes'),
 (10254, 'Chop-suey Chinese'),
 (10255, 'Richter Supermarkt'),
 (10256, 'Wellington Importadora'),
 (10257, 'HILARIÃN-Abastos')]

In [45]:
%%sql
SELECT COUNT(*) FROM (SELECT Orders.OrderID, Customers.CustomerName FROM Orders INNER JOIN Customers ON Orders.CustomerID = Customers.CustomerID);

 * sqlite:///first-database-sql.db
Done.

[(196,)]